Revit 2026 API

# MemberForces Properties

---

The MemberForces type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Force | The translational forces at relative point position of the element. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Moment | The rotational forces at relative point position of the element. |
|  | Start | Member Forces position on analytical element. True for start, false for end. |

#### Reference

MemberForces Class

Autodesk.Revit.DB.Structure Namespace